AccumulationRegisters/РасходыПоСделке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>РасходыПоСделке</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сделки</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/РаботаСоСделкамиРЕПО/Ext/Module.bsl
Функция РассчитатьСтавкуРЕПО(Сумма1Части, Сумма2Части, ДатаИсполнения1Части, ДатаИсполнения2Части, РазрядностьОкругления = 8) Экспорт
	
	Коэффициент = ПолучитьКоэффициентПериода(ДатаИсполнения1Части, ДатаИсполнения2Части);
	
	Если Коэффициент = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Окр(((Сумма2Части - Сумма1Части) / Сумма1Части) * (100 / Коэффициент), РазрядностьОкругления);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКоэффициентПериода(Знач НачалоПериода, КонецПериода) Экспорт
	
	Дней365	= 0;
	Дней366	= 0;
	
	Пока НачалоПериода < КонецПериода  Цикл
		НачалоПериода = НачалоПериода + 86400;
		
		Если (КонецГода(НачалоПериода) + 1 - НачалоГода(НачалоПериода)) / 86400 = 366 Тогда
			Дней366 = Дней366 + 1;
		Иначе
			Дней365 = Дней365 + 1;
		КонецЕсли; 
	КонецЦикла; 

	Возврат Дней365/365 + Дней366/366;
	
КонецФункции

Функция РассчитатьСправедливуюСтоимостьЗадолженностиПоСделкеРЕПО(Сумма, Процент, Знач ДатаИсполнения, ДатаРасчета, БазаРасчета = Неопределено) Экспорт
		
	ДнейПоБазе 		= 0;
	
	Если ЗначениеЗаполнено(БазаРасчета) Тогда	
		ДнейПоБазе = (НачалоДня(ДатаРасчета) - НачалоДня(ДатаИсполнения)) / 86400;
	    Возврат Окр(Сумма + (Сумма * Процент) / 100 * ДнейПоБазе/БазаРасчета, 2);
	Иначе	
		Возврат Окр(Сумма + (Сумма * Процент) / 100 * ПолучитьКоэффициентПериода(НачалоДня(ДатаИсполнения), НачалоДня(ДатаРасчета)), 2);
	КонецЕсли;	
		
КонецФункции

Функция РассчитатьЗадолженностьПоСделкеРЕПОПоРавномерномуРаспределениюПоДням(Сумма1Части, Сумма2Части, ДатаИсполнения1Части, ДатаИсполнения2Части, ДатаОценки) Экспорт

	ДнейВсего = (НачалоДня(ДатаИсполнения2Части) - НачалоДня(ДатаИсполнения1Части)) / 86400;
	СуммаВсего = Сумма2Части - Сумма1Части;
	ДнейПериода = (НачалоДня(ДатаОценки) - НачалоДня(ДатаИсполнения1Части)) / 86400;
	
	Возврат Окр(СуммаВсего / ДнейВсего * ДнейПериода, 2) + Сумма1Части;

КонецФункции 

Функция ПолучитьДоходностьИДюрациюПоСделкеРЕПО(СделкаРЕПО, Период, СуммаПервойЧасти) Экспорт
	
	ДенежныеПотокиПоСделкеРЕПО = ПолучитьПлановыеВыплатыПоСделкеРЕПО(СделкаРЕПО, Период);
	
	Возврат БухгалтерскийУчет.РассчитатьДоходностьИДюрациюПоПотоку(ДенежныеПотокиПоСделкеРЕПО, НачалоДня(СделкаРЕПО.Дата), СуммаПервойЧасти);
	
КонецФункции

Функция ПолучитьПлановыеВыплатыПоСделкеРЕПО(СделкаРЕПО, Период, ВключатьКомиссииВДенежныеПотоки = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаРЕПО.Ссылка КАК СделкаРЕПО,
		|	СделкаРЕПО.Организация КАК Организация,
		|	СделкаРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СделкаРепо
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПО
		|ГДЕ
		|	СделкаРЕПО.Ссылка = &СделкаРЕПО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Период КАК Период,
		|	ВложенныйЗапрос.Сумма КАК Сумма,
		|	ВложенныйЗапрос.Тип КАК Тип
		|ИЗ
		|	(ВЫБРАТЬ
		|		РасходыПоСделкеОбороты.Период КАК Период,
		|		-РасходыПоСделкеОбороты.СуммаОборот КАК Сумма,
		|		РасходыПоСделкеОбороты.ВидЗадолженности КАК Тип
		|	ИЗ
		|		РегистрНакопления.РасходыПоСделке.Обороты(
		|				&ДатаСделки,
		|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|				День,
		|				(Организация, СчетДоверительногоУправления, Сделка) В
		|						(ВЫБРАТЬ
		|							_СделкаРепо.Организация,
		|							_СделкаРепо.СчетДоверительногоУправления,
		|							_СделкаРепо.СделкаРЕПО
		|						ИЗ
		|							_СделкаРепо КАК _СделкаРепо)
		|					И &ВключатьКомиссииВДенежныеПотоки) КАК РасходыПоСделкеОбороты
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО
		|			ИНАЧЕ УсловияСделокРЕПОСрезПоследних.ДатаОплаты
		|		КОНЕЦ,
		|		УсловияСделокРЕПОСрезПоследних.Сумма + УсловияСделокРЕПОСрезПоследних.СуммаКупона,
		|		""Оплата второй части""
		|	ИЗ
		|		РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|				(Организация, СчетДоверительногоУправления, СделкаРЕПО) В
		|						(ВЫБРАТЬ
		|							_СделкаРепо.Организация,
		|							_СделкаРепо.СчетДоверительногоУправления,
		|							_СделкаРепо.СделкаРЕПО
		|						ИЗ
		|							_СделкаРепо КАК _СделкаРепо)
		|					И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПОСрезПоследних) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Период"							, Период);
	Запрос.УстановитьПараметр("СделкаРЕПО"						, СделкаРЕПО);
	Запрос.УстановитьПараметр("ДатаСделки"						, СделкаРЕПО.Дата);
	Запрос.УстановитьПараметр("ВключатьКомиссииВДенежныеПотоки"	, ВключатьКомиссииВДенежныеПотоки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
